In [1]:
%load_ext sql

In [3]:
%sql sqlite:///./test.db

'Connected: @./test.db'

In [4]:
%%sql
Create Table Employees
(
Employee_no BigInt,
Birth_date Date,
First_name Varchar(50),
Last_name Varchar(50),
Joining_date Date
);

 * sqlite:///./test.db
Done.

[]

In [5]:
%%sql
INSERT INTO Employees Values(1001,CAST('1988-08-15' AS Date),'ADAM','WAUGH', CAST('2013-04-12' AS Date));
INSERT INTO Employees Values(1002,CAST('1990-05-10' AS Date),'Mark','Jennifer', CAST('2010-06-25' AS Date));
INSERT INTO Employees Values(1003,CAST('1992-02-07' AS Date),'JOHN','Waugh', CAST('2016-02-07' AS Date));
INSERT INTO Employees Values(1004,CAST('1985-06-12' AS Date),'SOPHIA TRUMP','', CAST('2016-02-15' AS Date));
INSERT INTO Employees Values(1005,CAST('1995-03-25' AS Date),'Maria','Gracia', CAST('2011-04-09' AS Date));
INSERT INTO Employees Values(1006,CAST('1994-06-23' AS Date),'ROBERT','PATRICA', CAST('2015-06-23' AS Date));
INSERT INTO Employees Values(1007,CAST('1993-04-05' AS Date),'MIKE JOHNSON','', CAST('2014-03-09' AS Date));
INSERT INTO Employees Values(1008,CAST('1989-04-05' AS Date),'JAMES','OLIVER', CAST('2017-01-15' AS Date));

 * sqlite:///./test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%sql select * from employees

 * sqlite:///./test.db
Done.

[(1001, 1988, 'ADAM', 'WAUGH', 2013),
 (1002, 1990, 'Mark', 'Jennifer', 2010),
 (1003, 1992, 'JOHN', 'Waugh', 2016),
 (1004, 1985, 'SOPHIA TRUMP', '', 2016),
 (1005, 1995, 'Maria', 'Gracia', 2011),
 (1006, 1994, 'ROBERT', 'PATRICA', 2015),
 (1007, 1993, 'MIKE JOHNSON', '', 2014),
 (1008, 1989, 'JAMES', 'OLIVER', 2017)]

In [7]:
%sql select * from employees where first_name <> upper(first_name)

 * sqlite:///./test.db
Done.

[(1002, 1990, 'Mark', 'Jennifer', 2010), (1005, 1995, 'Maria', 'Gracia', 2011)]

In [24]:
%%sql select employee_no,
case when instr(first_name,' ') = 0 then first_name 
else substr(first_name,0,instr(first_name,' ')) end first_name,
case when instr(first_name,' ') = 0 then last_name
else substr(first_name,instr(first_name,' ')) end as last_name from employees

 * sqlite:///./test.db
Done.

[(1001, 'ADAM', 'WAUGH'),
 (1002, 'Mark', 'Jennifer'),
 (1003, 'JOHN', 'Waugh'),
 (1004, 'SOPHIA', ' TRUMP'),
 (1005, 'Maria', 'Gracia'),
 (1006, 'ROBERT', 'PATRICA'),
 (1007, 'MIKE', ' JOHNSON'),
 (1008, 'JAMES', 'OLIVER')]